# GetRelatedElements Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFC..::..GetRelatedElements Method
ExporterIFC Class See Also
---
Gets all elements not associated to stories.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ICollection<IFCAnyHandle> GetRelatedElements()
```

Visual Basic
---
```text
Public Function GetRelatedElements As ICollection(Of IFCAnyHandle)
```

Visual C++
---
```text
public:
ICollection<IFCAnyHandle^>^ GetRelatedElements()
```

# ### Return Value
The collection of elements.
# See Also
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace